using Transliterator.Domain.Entities;

namespace Transliterator.Tests
{
    public static class TestProfiles
    {
        public static TransliterationProfile StandardProfile => new TransliterationProfile
        {
            Name = "Standard",
            Description = "Хардкодированный профиль для юнит-тестов",
            Rules = new Dictionary<string, string>
            {
                { "ا", "а" },
                { "أ", "а" },
                { "إ", "и" },
                { "آ", "а̄" },
                { "ٱ", "á" },
                { "ى", "а" },
                { "ٰ", "а" },
                { "ۤ", "" },
                { "ٲ", "а" },
                { "ٳ", "а" },
                { "ب", "б" },
                { "ت", "т" },
                { "ث", "с́" },
                { "ج", "дж" },
                { "ح", "хI" },
                { "خ", "хъ" },
                { "د", "д" },
                { "ذ", "зъ" },
                { "ر", "р" },
                { "ز", "з" },
                { "س", "с" },
                { "ش", "щ" },
                { "ص", "сI" },
                { "ض", "дI" },
                { "ط", "тI" },
                { "ظ", "зI" },
                { "ع", "'" },
                { "غ", "гъ" },
                { "ف", "ф" },
                { "ق", "q" },
                { "ك", "к" },
                { "ل", "л" },
                { "م", "м" },
                { "ن", "н" },
                { "ه", "h" },
                { "و", "у" },
                { "ي", "й" },
                { "َ", "а" },
                { "ُ", "у" },
                { "ِ", "и" },
                { "ٌ", "ун" },
                { "ٍ", "ин" },
                { "ً", "ан" },
                { "ـٰ", "а" },
                { "٠", "0" },
                { "١", "1" },
                { "٢", "2" },
                { "٣", "3" },
                { "٤", "4" },
                { "٥", "5" },
                { "٦", "6" },
                { "٧", "7" },
                { "٨", "8" },
                { "٩", "9" }
            }
        };
    }
}
